Repository: marlonespelho/vacancy_controller
Catalog: lib/l10n/intl_*.arb
Languages: pt_br

# badRequestExceptionMessage
source: Bad request, please check the data and try again.
pt_br: Requisição má sucedida, verifique os dados e tente novamente.

# unauthorizedExceptionMessage
source: Unauthorized
pt_br: Não autorizado

# unauthorizedAlertMessage
source: Your session has expired, please log in again to continue using the app.
pt_br: Sua sessão expirou, faça login novamente para continuar utilizando o aplicativo.

# notFoundExceptionMessage
source: Not found.
pt_br: Não encontrado.

# noConnectionExceptionMessage
source: No connection.
pt_br: Sem conexão.

# timeOutExceptionMessage
source: Request timeout.
pt_br: Tempo de requisição expirado.

# defaultExceptionMessage
source: Service unavailable at the moment, please try again later.
pt_br: Serviço indisponível no momento, tente novamente mais tarde.

# homeAppBarTitle
source: Parking Control
pt_br: Controle de Estacionamento

# favoritePageTitle
source: Favorites
pt_br: Favoritos

# backButtonLabel
source: Back
pt_br: Voltar

# showToastErrorMessage
source: Error displaying message.
pt_br: Erro ao exibir mensagem.

# emptyParkingListMessage
source: No parking spots created.
pt_br: Nenhuma vaga de estacionamento criada.

# emptyParkingListButtonText
source: Create a new spot
pt_br: Crie uma nova vaga

# cancelButtonText
source: Cancel
pt_br: Cancelar

# registerParkingEntryButtonText
source: Register entry
pt_br: Registrar entrada

# registerParkingEntryDialogTitle
source: Register parking entry
pt_br: Registrar entrada de estacionamento

# registerParkingEntryDialogContent
source: Enter the license plate of the vehicle you want to register in spot {value}.
pt_br: Informe a placa do veículo que deseja registrar na vaga {value}.

# registerParkingEntryDialogTextFieldErrorMessage
source: Invalid license plate, please check and try again.
pt_br: Placa inválida, verifique e tente novamente.

# confirmParkingExitDialogTitle
source: Confirm parking exit
pt_br: Confirmar Saída de estacionamento

# confirmParkingExitDialogContent
source: Are you sure you want to register the exit of vehicle {plate} from spot {parking}?
pt_br: Você tem certeza que deseja registrar a saída do veículo {plate} da vaga {parking}?

# confirmButtonText
source: Confirm
pt_br: Confirmar

# addParkingCardTitle
source: Add Spot
pt_br: Adicionar Vaga

# parkingAvailableText
source: Spot available
pt_br: Vaga disponível

# tapToAddParkingCardText
source: Tap to register entry
pt_br: Toque para registrar entrada

# vehicleLabel
source: Vehicle:
pt_br: Veículo:

# confirmParkingDeleteDialogTitle
source: Confirm deletion
pt_br: Confirmar exclusão

# confirmParkingDeleteDialogContent
source: Are you sure you want to delete spot {parking}?
pt_br: Você tem certeza que deseja excluir a vaga {parking}?

# parkingHistoryFABLabel
source: History
pt_br: Histórico

# parkingHistoryAppBarTitle
source: Parking History
pt_br: Histórico de Estacionamento

# emptyParkingHistoryListMessage
source: No parking records found.
pt_br: Nenhum registro de estacionamento encontrado.

# parkingNotExitedYet
source: Spot still occupied.
pt_br: Vaga ainda ocupada.

# entryDateLabel
source: Entry date:
pt_br: Data de entrada:

# exitDateLabel
source: Exit date:
pt_br: Data de saída:
